Revit 2026 API

# FamilyInstanceHostParameter Property

---

If the instance is hosted by a wall, this property returns the parameter value of the insertion point of the instance along the wall's location curve, as long as the family of the instance isn't work plane based.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double HostParameter { get; }
```
```vb
Public ReadOnly Property HostParameter As Double
	Get
```
```cpp
public:
property double HostParameter {
	double get ();
}
```
```fsharp
member HostParameter : float with get
```

#### Property Value

Double

| Exception | Condition |
| --- | --- |
| InvalidOperationException | Only hosted instances whose family is not work plane based can support this functionality. |
| InvalidOperationException | Only hosted instances of type Wall or in-place elements of category OST_Walls can support this functionality. |

This works for instances with a host element that is of type Wall or is in the OST_Walls category only, including in-place ones.

#### Reference

FamilyInstance Class

Autodesk.Revit.DB Namespace